Revit 2027 API
BuiltInFailures.SketchFailures.ConstantHeightNotParallelError Property
 Constant-height-defining lines must be parallel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ConstantHeightNotParallelError { get; }
Public Shared ReadOnly Property ConstantHeightNotParallelError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ConstantHeightNotParallelError {
	FailureDefinitionId^ get ();
}
static member ConstantHeightNotParallelError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace